# Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.
str1 = 'привет мир, привет коллеги, привет друзья'
str2 = 'привет'
print(f'количество вхождений одной строки {str2} в строкум{str1} равно {str1.count(str2)}')