#  Напишите программу генерации рандомного числа (написать аналог функции )
import time
import datetime
print(datetime.datetime.now().microsecond % 100)
# или делим на кол-во элементов в списке для рандомного перемешивания списка
#  
